<?php

use Illuminate\Database\Seeder;
use App\Group;
use App\Student;

class StudentsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run() {
        // 우리반 구하기
        $group = Group::all()->all()[0]->id;

        // 우리반 목록
        $students = [
            1201224	    => '이세혁',
            1301036	    => '김민수',
            1301052	    => '김영문',
            1301102	    => '박병옥',
            1301143	    => '성형석',
            1301151	    => '송솔',
            1301235	    => '장세원',
            1301238	    => '장준수',
            1301240	    => '전상원',
            1301264	    => '정현우',
            1301281	    => '최민석',
            1301282	    => '최병찬',
            1301292	    => '하재형',
            1401004	    => '강상운',
            1401016	    => '권범수',
            1401050	    => '김성준',
            1401055	    => '김승목',
            1401117	    => '류호형',
            1401134	    => '박주용',
            1401136	    => '박준상',
            1401145	    => '박효동',
            1401163	    => '손진호',
            1401179	    => '안준휘',
            1401185	    => '염세환',
            1401213	    => '이승민',
            1401228	    => '이준영',
            1401280	    => '진성규',
            1401290	    => '최요한',
            1601005	    => '강성은',
            1601012	    => '곽다희',
            1601128	    => '성경임',
            1601129	    => '성기혁',
            1601145	    => '심유림',
            1601155	    => '오윤정',
            1601176	    => '윤진주',
            1601193	    => '이성민',
            1601204 	=> '이아름',
            1601224	    => '이지윤',
            1601228	    => '이하연',
            1601230	    => '이혜미',
            1601232	    => '이효진',
            1601242	    => '장다연',
            1601259	    => '정지민',
            1601266	    => '조수진',
            1601273	    => '주영호',
            1601279	    => '최선주',
            1601286	    => '최준규',
            1601305	    => '황금비'
        ];

        // 각 학생의 계정 생성하기
        foreach($students as $std_id => $name) {
            Student::insert([
                'id'            => $std_id,
                'group'         => $group,
                'password'      => password_hash('aaaa', PASSWORD_DEFAULT),
                'name'          => $name,
                'phone'         => '01012345678',
                'email'         => 'exam@exam.com',
                'face_photo'    => ''
            ]);
        }
    }
}
